HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/laminar/bubbleColumnEvaporating/system/continuityFunctions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

inletMassFlowRate
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    fields
    (
        alphaRhoPhi.gas
        alphaRhoPhi.liquid
    );

    writeFields     false;
    log             true;
    surfaceFormat   null;

    regionType      patch;
    name            inlet;

    operation       sum;

    writeControl   timeStep;
}

outletMassFlowRate
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    fields
    (
        alphaRhoPhi.gas
        alphaRhoPhi.liquid
    );

    writeFields     false;
    log             true;
    surfaceFormat   null;

    regionType      patch;
    name            outlet;

    operation       sum;

    writeControl   timeStep;
}

totalMass
{
    type            coded;
    libs            ("libutilityFunctionObjects.so");
    name    error;

    code
    #{
        const volScalarField& alphaGas =
            mesh().lookupObject<volScalarField>("alpha.gas");
        const volScalarField& alphaLiquid =
            mesh().lookupObject<volScalarField>("alpha.liquid");

        const volScalarField& rhoGas =
            mesh().lookupObject<volScalarField>("thermo:rho.gas");
        const volScalarField& rhoLiquid =
            mesh().lookupObject<volScalarField>("thermo:rho.liquid");

        const volScalarField& dmdt =
            mesh().lookupObject<volScalarField>("dmdt.gasAndLiquid");

        const scalarField& v = mesh().V();

        Info<< "coded totalMass output:" << endl
            << "    volIntegrate(all) for alpha.gas*rho.gas = "
            << gSum(alphaGas*rhoGas*v) << endl
            << "    volIntegrate(all) for alpha.liquid*rho.liquid = "
            << gSum(alphaLiquid*rhoLiquid*v) << endl
            << "    volIntegrate(all) for dmdt = "
            << gSum(dmdt*v) << endl
            << endl;
    #};
}

// ************************************************************************* //
